Repository: bahodir0902/Eshop
Catalog: locale/*/LC_MESSAGES/django.po
Languages: uz

source: Email
uz: Elektron pochta

source: Password
uz: Parol

source: First Name
uz: Ism

source: Last Name
uz: Familiya

source: Address Line 1
uz: Manzil qatori 1

source: Address Line 2
uz: Manzil qatori 2

source: City
uz: Shahar

source: Country
uz: Mamlakat

source: Postal Code
uz: Pochta indeksi

source: Phone Number
uz: Telefon raqami

source: User
uz: Foydalanuvchi

source: State/Province
uz: Viloyat/Tuman

source: Cart
uz: Savat

source: English
uz: Inglizcha

source: Russian
uz: Ruscha

source: Uzbek
uz: O'zbekcha

source: Processing
uz: Ishlov berilmoqda

source: Shipped
uz: Jo'natilgan

source: Delivered
uz: Yetkazib berilgan

source: Return Requested
uz: Qaytarish so'rovi

source: Returned
uz: Qaytarilgan

source: Refunded
uz: Qaytarilgan pul

source: Shipping Address
uz: Yetkazib berish manzili

source: Credit Card
uz: Kredit kartasi

source: Payment Method
uz: To'lov usuli

source: Payment
uz: To'lov

source: Name
uz: Nomi

source: Category
uz: Kategoriya

source: Categories
uz: Kategoriyalar

source: Stock Count
uz: Ombordagi soni

source: Inventory
uz: Inventar

source: Price
uz: Narx

source: Short Description
uz: Qisqa tavsif

source: Shop
uz: Do'kon

source: Full Description
uz: To'liq tavsif

source: Key Features
uz: Asosiy xususiyatlar

source: Specifications
uz: Texnik xususiyatlar

source: Image
uz: Rasm

source: Products
uz: Mahsulotlar

source: Rating
uz: Reyting

source: Description
uz: Tavsif

source: Verify Your Email 📩
uz: Elektron pochtangizni tasdiqlang 📩

source: We've sent you a 4-digit passcode to verify your email address. Please check your inbox (and spam folder just in case) and enter the code below to proceed.
uz: Elektron pochtangizni tasdiqlash uchun 4 raqamli parolni yubordik. Iltimos, kiruvchi xatlar qutisini (va ehtimol spam papkasini) tekshiring va davom etish uchun quyidagi kodni kiriting.

source: Enter 4-digit code
uz: 4 raqamli kodni kiriting

source: Verify
uz: Tasdiqlash

source: Didn't receive the email?
uz: Elektron xat kelmadimi?

source: Try again
uz: Qayta urinib ko'ring

source: Reset Your Password
uz: Parolingizni tiklash

source: Enter a new password to update your account.
uz: Hisobingizni yangilash uchun yangi parol kiriting.

source: New Password
uz: Yangi parol

source: Confirm Password
uz: Parolni tasdiqlang

source: Reset Password
uz: Parolni tiklash

source: Passwords do not match! 🔴
uz: Parollar mos kelmaydi! 🔴

source: Passwords do not match! Please try again.
uz: Parollar mos kelmaydi! Iltimos, qayta urinib ko'ring.

source: Login
uz: Kirish

source: Welcome Back
uz: Xush kelibsiz

source: Sign in to continue your shopping journey
uz: Xarid sayohatingizni davom ettirish uchun tizimga kiring

source: Please enter your credentials
uz: Iltimos, ma'lumotlaringizni kiriting

source: Email Address
uz: Elektron pochta manzili

source: Remember me
uz: Meni eslab qol

source: Forgot Password?
uz: Parolni unutdingizmi?

source: Log In
uz: Kirish

source: Don\
uz: Hisobingiz yo'qmi\

source: Register
uz: Ro'yxatdan o'tish

source: Personal Information
uz: Shaxsiy ma'lumot

source: Edit
uz: Tahrirlash

source: Address Details
uz: Manzil ma'lumotlari

source: Is primary address
uz: Asosiy manzil

source: No address information has been added yet.
uz: Hali manzil ma'lumotlari qo'shilmagan.

source: Add address details
uz: Manzil ma'lumotlarini qo'shish

source: Edit Profile
uz: Profilni tahrirlash

source: Update your personal information and address details
uz: Shaxsiy ma'lumotlaringiz va manzil ma'lumotlaringizni yangilang

source: Address Line 2 (Optional)
uz: Manzil qatori 2 (Ixtiyoriy)

source: Cancel
uz: Bekor qilish

source: Save Changes
uz: O'zgarishlarni saqlash

source: Create Account
uz: Hisob yaratish

source: Personal Info
uz: Shaxsiy ma'lumot

source: Your basic details
uz: Asosiy ma'lumotlaringiz

source: Account Info
uz: Hisob ma'lumotlari

source: Set up your login
uz: Kirishingizni sozlang

source: Confirm Information
uz: Ma'lumotlarni tasdiqlash

source: Review your details
uz: Ma'lumotlaringizni ko'rib chiqing

source: Verification
uz: Tekshirish

source: Enter code from email
uz: Elektron pochtadan kodni kiriting

source: Join Our Community
uz: Bizning hamjamiyatimizga qo'shiling

source: Fill in your details to create an account
uz: Hisob yaratish uchun ma'lumotlaringizni to'ldiring

source: Next
uz: Keyingi

source: Back
uz: Orqaga

source: Review Your Information
uz: Ma'lumotlaringizni ko'rib chiqing

source: First Name:
uz: Ism:

source: Last Name:
uz: Familiya:

source: Email:
uz: Elektron pochta:

source: Terms of Service
uz: Xizmat ko'rsatish shartlari

source: Welcome to our website. If you continue to browse and use this website, you are agreeing to comply with and be bound by the following terms and conditions of use.
uz: Veb-saytimizga xush kelibsiz. Agar siz ushbu veb-saytni ko'rib chiqishni va foydalanishni davom ettirsangiz, quyidagi foydalanish shartlari va qoidalariga rioya qilishga va bog'lanishga rozi bo'lasiz.

source: The content of the pages of this website is for your general information and use only. It is subject to change without notice.
uz: Ushbu veb-saytning sahifalari mazmuni faqat umumiy ma'lumot va foydalanish uchun. U oldindan ogohlantirmasdan o'zgartirilishi mumkin.

source: This website uses cookies to monitor browsing preferences. If you do allow cookies to be used, personal information may be stored by us for use by third parties.
uz: Ushbu veb-sayt brauzerda ko'rish imkoniyatlarini kuzatish uchun cookie-fayllardan foydalanadi. Agar siz cookie-fayllardan foydalanishga ruxsat bersangiz, shaxsiy ma'lumotlar uchinchi shaxslar tomonidan foydalanish uchun biz tomonimizdan saqlanishi mumkin.

source: Neither we nor any third parties provide any warranty or guarantee as to the accuracy, timeliness, performance, completeness or suitability of the information and materials found or offered on this website for any particular purpose.
uz: Na biz, na uchinchi shaxslar ushbu veb-saytda topilgan yoki taklif etilgan ma'lumotlar va materiallarning aniqligini, o'z vaqtidaligini, ishlashini, to'liqligini yoki biron bir maqsadga mosligini kafolatlamaydi yoki kafolat bermaydi.

source: I agree to the Terms of Service and Privacy Policy
uz: Xizmat ko'rsatish shartlari va Maxfiylik siyosatiga roziman

source: Subscribe to our newsletter for updates and offers
uz: Yangilanishlar va takliflar uchun bizning axborot byulletenimizga obuna bo'ling

source: Submit Details
uz: Ma'lumotlarni yuborish

source: Email Verification
uz: Elektron pochta tekshiruvi

source: We've sent a 4-digit verification code to your email. Please enter it below to complete your registration.
uz: Elektron pochtangizga 4 raqamli tekshirish kodini yubordik. Ro'yxatdan o'tishni yakunlash uchun uni quyida kiriting.

source: Didn't receive a code?
uz: Kod kelmadimi?

source: Resend Code
uz: Kodni qayta yuborish

source: Complete Registration
uz: Ro'yxatdan o'tishni yakunlash

source: Already have an account?
uz: Hisobingiz bormi?

source: Enter your email address, and we'll send you a password reset link.
uz: Elektron pochta manzilingizni kiriting, va biz sizga parolni tiklash havolasini yuboramiz.

source: Send Reset Link
uz: Tiklash havolasini yuborish

source: Back to Login
uz: Kirishga qaytish

source: Verify Your New Email
uz: Yangi elektron pochtangizni tasdiqlang

source: We've sent a verification code to your new email address <b>%(email)s</b>. Please check your inbox (and spam folder just in case) and enter the code below to confirm your email change.
uz: Yangi elektron pochta manzilingizga <b>%(email)s</b> tekshirish kodini yubordik. Iltimos, kiruvchi xatlar qutisini (va ehtimol spam papkasini) tekshiring va elektron pochta o'zgarishingizni tasdiqlash uchun quyidagi kodni kiriting.

source: Enter verification code
uz: Tekshirish kodini kiriting

source: Didn\'t receive the email?
uz: Elektron xat kelmadimi?

source: Resend Verification Code
uz: Tekshirish kodini qayta yuborish

source: E-Shop
uz: E-Do'kon

source: Toggle navigation
uz: Navigatsiyani almashtirish

source: Deals
uz: Takliflar

source: Manage Products
uz: Mahsulotlarni boshqarish

source: View Shopping Cart
uz: Xarid savatini ko'rish

source: View Wishlist
uz: Istaklar ro'yxatini ko'rish

source: My Account
uz: Mening hisobim

source: My Profile
uz: Mening profilim

source: My Orders
uz: Mening buyurtmalarim

source: Logout
uz: Chiqish

source: Sign Up
uz: Ro'yxatdan o'tish

source: Home
uz: Bosh sahifa

source: Wishlist
uz: Istaklar ro'yxati

source: Account
uz: Hisob

source: All Rights Reserved.
uz: Barcha huquqlar himoyalangan.

source: Your one-stop shop for amazing products. We focus on quality, affordability, and customer satisfaction.
uz: Ajoyib mahsulotlar uchun yagona do'koningiz. Biz sifat, qulay narx va mijozlar mamnuniyatiga e'tibor qaratamiz.

source: Quick Links
uz: Tezkor havolalar

source: About Us
uz: Biz haqimizda

source: My Cart
uz: Mening savatim

source: Order History
uz: Buyurtmalar tarixi

source: Stay Connected
uz: Bog'lanishda bo'ling

source: Follow us on social media for updates and offers.
uz: Yangiliklar va takliflar uchun ijtimoiy tarmoqlarda bizni kuzatib boring.

source: Privacy Policy
uz: Maxfiylik siyosati

source: Your Shopping Cart
uz: Sizning xarid savatingiz

source: Details
uz: Tafsilotlar

source: Confirmation
uz: Tasdiqlash

source: Items in Your Cart
uz: Savatingizdagi mahsulotlar

source: %(counter)s Item
uz: %(counter)s ta mahsulot

source: Your cart is empty
uz: Savatingiz bo'sh

source: Looks like you haven\'t added any products to your cart yet.
uz: Hali savatingizga hech qanday mahsulot qo'shmaganga o'xshaysiz.

source: Continue Shopping
uz: Xaridni davom ettirish

source: View
uz: Ko'rish

source: DISCOUNTED
uz: CHEGIRMALI

source: Decrease quantity
uz: Miqdorni kamaytirish

source: Increase quantity
uz: Miqdorni oshirish

source: Remove item
uz: Mahsulotni olib tashlash

source: Save for later
uz: Keyinroq uchun saqlash

source: Clear Cart
uz: Savatni tozalash

source: Order Summary
uz: Buyurtma xulosasi

source: Subtotal (%(counter)s item)
uz: Oraliq jami (%(counter)s ta mahsulot)

source: Shipping
uz: Yetkazib berish

source: Calculated at checkout
uz: To'lov paytida hisoblanadi

source: Promo Code
uz: Promo kod

source: Apply
uz: Qo'llash

source: Total
uz: Jami

source: Proceed to Checkout
uz: To'lovga o'tish

source: We Accept
uz: Biz qabul qilamiz

source: My Cosmic Collection
uz: Mening kosmik kolleksiyam

source: Your universe of favorite items
uz: Sevimli mahsulotlaringiz olami

source: Disintegrate All
uz: Hammasini o'chirish

source: In Stock
uz: Mavjud

source: Out of Stock
uz: Mavjud emas

source: Remove from favorites
uz: Sevimlilardan olib tashlash

source: View details
uz: Tafsilotlarni ko'rish

source: Add to cart
uz: Savatga qo'shish

source: Category:
uz: Kategoriya:

source: Your Cosmic Collection Is Empty
uz: Sizning kosmik kolleksiyangiz bo'sh

source: Start adding your favorite products to create your personal galaxy of amazing items!
uz: Ajoyib mahsulotlardan iborat shaxsiy galaktikangizni yaratish uchun sevimli mahsulotlaringizni qo'sha boshlang!

source: Explore Products
uz: Mahsulotlarni ko'rib chiqish

source: Shop Now
uz: Hozir xarid qilish

source: New
uz: Yangi

source: Secure Payment
uz: Xavfsiz to'lov

source: Checkout - Details
uz: To'lov - Tafsilotlar

source: Checkout
uz: To'lov

source: Delivery Details
uz: Yetkazib berish tafsilotlari

source: Step 2 of 4
uz: 4 dan 2-qadam

source: Contact Information
uz: Aloqa ma'lumotlari

source: Enter your email
uz: Elektron pochtangizni kiriting

source: Enter your phone number
uz: Telefon raqamingizni kiriting

source: Enter your first name
uz: Ismingizni kiriting

source: Enter your last name
uz: Familiyangizni kiriting

source: Save this address to my profile and set as primary address?
uz: Ushbu manzilni profilimga saqlash va asosiy manzil sifatida o'rnatish?

source: We\
uz: Biz\

source: Delivery Options
uz: Yetkazib berish variantlari

source: Standard Delivery
uz: Standart yetkazib berish

source: 3-5 business days
uz: 3-5 ish kuni

source: Express Delivery
uz: Tezkor yetkazib berish

source: 1-2 business days
uz: 1-2 ish kuni

source: Next Day Delivery
uz: Keyingi kun yetkazib berish

source: Next business day
uz: Keyingi ish kuni

source: Back to Cart
uz: Savatga qaytish

source: Continue to Payment
uz: To'lovga o'tish

source: Subtotal
uz: Oraliq jami

source: All Orders
uz: Barcha buyurtmalar

source: Order #%(order_id)s
uz: Buyurtma #%(order_id)s

source: Order Placed
uz: Buyurtma qo'yilgan

source: No shipping address provided
uz: Yetkazib berish manzili ko'rsatilmagan

source: Method:
uz: Usul:

source: Items
uz: Mahsulotlar

source: No Image
uz: Rasm yo'q

source: Qty: %(qty)s
uz: Soni: %(qty)s

source: Subtotal:
uz: Oraliq jami:

source: Shipping:
uz: Yetkazib berish:

source: Discount (%(code)s):
uz: Chegirma (%(code)s):

source: Total:
uz: Jami:

source: View Details
uz: Tafsilotlarni ko'rish

source: You don\
uz: Sizda hech qanday buyurtma yo'q\

source: When you place orders, they will appear here
uz: Siz buyurtmalar qo'yganda, ular shu yerda paydo bo'ladi

source: Previous
uz: Oldingi

source: Checkout - Payment
uz: To'lov - To'lov ma'lumotlari

source: Payment Information
uz: To'lov ma'lumotlari

source: Step 3 of 4
uz: 4 dan 3-qadam

source: Card Details
uz: Karta ma'lumotlari

source: Card Holder's First and Last Name
uz: Karta egasining ismi va familiyasi

source: Enter cardholder\
uz: Karta egasini kiriting\

source: Card Number
uz: Karta raqami

source: Expiry Date
uz: Amal qilish muddati

source: MM/YY
uz: OO/YY

source: The 3-digit security code on the back of your card
uz: Kartangiz orqasidagi 3 raqamli xavfsizlik kodi

source: Back to Details
uz: Tafsilotlarga qaytish

source: Pay and Complete Order
uz: To'lash va buyurtmani yakunlash

source: Secure Checkout
uz: Xavfsiz to'lov

source: SSL Secured
uz: SSL bilan himoyalangan

source: Protected
uz: Himoyalangan

source: Checkout - Success
uz: To'lov - Muvaffaqiyatli

source: Thank You for Your Order!
uz: Buyurtmangiz uchun rahmat!

source: Order ID:
uz: Buyurtma ID:

source: Your payment has been successfully processed and your order is confirmed.
uz: To'lovingiz muvaffaqiyatli amalga oshirildi va buyurtmangiz tasdiqlandi.

source: Estimated delivery:
uz: Taxminiy yetkazib berish:

source: up to
uz: gacha

source: Shipping to:
uz: Yetkazib berish manzili:

source: Postal code
uz: Pochta indeksi

source: View Order Details
uz: Buyurtma tafsilotlarini ko'rish

source: Add Product
uz: Mahsulot qo'shish

source: Add New Product
uz: Yangi mahsulot qo'shish

source: Enter product details below
uz: Mahsulot tafsilotlarini quyida kiriting

source: Basic Information
uz: Asosiy ma'lumot

source: Product Name
uz: Mahsulot nomi

source: Choose a descriptive name for your product
uz: Mahsulotingiz uchun tavsiflovchi nom tanlang

source: Used in product URL: example-product
uz: Mahsulot URL-da ishlatiladi: misol-mahsulot

source: Classification
uz: Tasnif

source: Product Details
uz: Mahsulot tafsilotlari

source: Short catchy description for product listings (max 255 characters)
uz: Mahsulot ro'yxati uchun qisqa diqqatni tortadigan tavsif (maksimal 255 ta belgi)

source: Detailed product description with marketing tone
uz: Marketing ohangida batafsil mahsulot tavsifi

source: Enter features separated by comma
uz: Xususiyatlarni vergul bilan ajratib kiriting

source: Feature 1, Feature 2, Feature 3
uz: Xususiyat 1, Xususiyat 2, Xususiyat 3

source: Enter specifications as a key-value pair separated by comma
uz: Texnik xususiyatlarni kalit-qiymat juftligi sifatida vergul bilan ajratib kiriting

source: Weight: 2.5kg, Dimensions: 10 x 15 x 5 cm, Material: Aluminum
uz: Og'irligi: 2.5kg, O'lchamlari: 10 x 15 x 5 sm, Material: Alyuminiy

source: Product Image
uz: Mahsulot rasmi

source: Drop your image here or click to browse
uz: Rasmingizni shu yerga tashlang yoki ko'rish uchun bosing

source: Supports: JPG, PNG, GIF (Max 5MB)
uz: Qo'llab-quvvatlanadi: JPG, PNG, GIF (Maksimal 5MB)

source: No file selected
uz: Fayl tanlanmagan

source: Remove
uz: O'chirish

source: Product Status
uz: Mahsulot holati

source: Available for Purchase
uz: Sotib olish uchun mavjud

source: Make product visible to customers
uz: Mahsulotni mijozlar uchun ko'rinadigan qilish

source: Featured Product
uz: Tavsiya etilgan mahsulot

source: Show in featured sections
uz: Tavsiya etilgan bo'limlarda ko'rsatish

source: Discounted
uz: Chegirmali

source: Apply discount to this product
uz: Ushbu mahsulotga chegirma qo'llash

source: Launch Product
uz: Mahsulotni ishga tushirish

source: Edit Product
uz: Mahsulotni tahrirlash

source: Update product information
uz: Mahsulot ma'lumotlarini yangilash

source: Current image:
uz: Joriy rasm:

source: Preview
uz: Ko'rib chiqish

source: Product Showcase
uz: Mahsulotlar ko'rgazmasi

source: Product Collection
uz: Mahsulotlar kolleksiyasi

source: Search products...
uz: Mahsulotlarni qidirish...

source: Filters
uz: Filtrlar

source: Product Categories
uz: Mahsulot kategoriyalari

source: Reset
uz: Qayta o'rnatish

source: Filter Products
uz: Mahsulotlarni filtrlash

source: Sort By
uz: Saralash

source: Price: Low to High
uz: Narx: Arzondan qimmatga

source: Price: High to Low
uz: Narx: Qimmatdan arzon

source: Orders: Low to High
uz: Buyurtmalar: Kamdan ko'pga

source: Orders: High to Low
uz: Buyurtmalar: Ko'pdan kamga

source: Newest First
uz: Avval yangilari

source: Price Range
uz: Narx oralig'i

source: Max $
uz: Maks $

source: Apply Filters
uz: Filtrlarni qo'llash

source: Rating: %(rating)s+ stars
uz: Reyting: %(rating)s+ yulduz

source: Category: %(name)s
uz: Kategoriya: %(name)s

source: Clear All
uz: Hammasini tozalash

source: No filters applied
uz: Filtrlar qo'llanilmagan

source: Sort by:
uz: Saralash:

source: Featured
uz: Tanlanganlar

source: Most Popular
uz: Eng mashhur

source: In Cart (%(quantity)s)
uz: Savatda (%(quantity)s)

source: Added %(date)s
uz: Qo'shilgan %(date)s

source: %(total)s Ordered
uz: %(total)s ta buyurtma qilingan

source: In your cart: <strong>%(quantity)s</strong>
uz: Savatingizda: <strong>%(quantity)s</strong>

source: Buy Now
uz: Hozir sotib olish

source: Update Cart
uz: Savatni yangilash

source: Add to Cart
uz: Savatga qo'shish

source: No Products Available
uz: Mavjud mahsulotlar yo'q

source: Check back soon for new additions to our catalog.
uz: Katalogimizga yangi qo'shilgan mahsulotlar uchun tez orada qayta tekshiring.

source: Product Management
uz: Mahsulotlarni boshqarish

source: Total Products
uz: Jami mahsulotlar

source: Active
uz: Faol

source: Inventory Value
uz: Inventar qiymati

source: All Categories
uz: Barcha kategoriyalar

source: All Status
uz: Barcha statuslar

source: Sort By:
uz: Saralash:

source: Name (A-Z)
uz: Nomi (A-Z)

source: Name (Z-A)
uz: Nomi (Z-A)

source: Oldest First
uz: Avval eskilari

source: Price (High-Low)
uz: Narx (Yuqori-past)

source: Price (Low-High)
uz: Narx (Past-yuqori)

source: Items Per Page:
uz: Sahifada mahsulotlar soni:

source: Edit Selected
uz: Tanlanganni tahrirlash

source: Delete Selected
uz: Tanlanganni o'chirish

source: Export Selected
uz: Tanlanganni eksport qilish

source: Stock
uz: Mavjud

source: Created
uz: Yaratilgan

source: Actions
uz: Harakatlar

source: Uncategorized
uz: Kategoriyasiz

source: Delete
uz: O'chirish

source: Get started by adding your first product to the inventory.
uz: Inventarga birinchi mahsulotingizni qo'shish bilan boshlang.

source: Confirm Deletion
uz: O'chirishni tasdiqlash

source: Are you sure you want to delete this product? This action cannot be undone.
uz: Haqiqatan ham bu mahsulotni o'chirishni xohlaysizmi? Bu amalni bekor qilib bo'lmaydi.

source: Additional view
uz: Qo'shimcha ko'rinish

source: off
uz: chegirma

source: available
uz: mavjud

source: In cart:
uz: Savatda:

source: items
uz: mahsulotlar

source: Shop:
uz: Do'kon:

source: Added:
uz: Qo'shilgan:

source: Reviews
uz: Sharhlar

source: Shipping & Returns
uz: Yetkazib berish va qaytarish

source: Product Specifications
uz: Mahsulot texnik xususiyatlari

source: Customer Reviews
uz: Mijozlar sharhlari

source: Based on
uz: Asoslangan

source: reviews
uz: sharhlar

source: star
uz: yulduz

source: Anonymous
uz: Anonim

source: Review image
uz: Sharh rasmi

source: No feedbacks available for this product
uz: Bu mahsulot uchun sharhlar mavjud emas

source: Edit Your Review,Write a Review
uz: Sharhingizni tahrirlash,Sharh yozish

source: Review(Optional)
uz: Sharh (Ixtiyoriy)

source: Share your experience with this product
uz: Bu mahsulot bilan tajribangizni baham ko'ring

source: Post anonymously
uz: Anonim ravishda nashr etish

source: Add Image (Optional)
uz: Rasm qo'shish (Ixtiyoriy)

source: Update Review,Submit Review
uz: Sharhni yangilash,Sharhni yuborish

source: Delete Review
uz: Sharhni o'chirish

source: You must purchase this product to write a review.
uz: Sharh yozish uchun bu mahsulotni sotib olishingiz kerak.

source: Shipping Policy
uz: Yetkazib berish siyosati

source: We offer standard shipping that typically takes 3-5 business days. Express shipping options are available at checkout for faster delivery.
uz: Biz odatda 3-5 ish kuni ichida yetkazib beriladigan standart yetkazib berishni taklif qilamiz. Tezroq yetkazib berish uchun to'lov paytida tezkor yetkazib berish variantlari mavjud.

source: Return Policy
uz: Qaytarish siyosati

source: If you\
uz: Agar siz\

source: International Shipping
uz: Xalqaro yetkazib berish

source: We ship to most countries worldwide. International shipping times may vary depending on your location and local customs processing.
uz: Biz dunyo bo'ylab ko'pgina mamlakatlarga yetkazib beramiz. Xalqaro yetkazib berish vaqti joylashuvingiz va mahalliy bojxona ishloviga qarab o'zgarishi mumkin.

source: You May Also Like
uz: Sizga ham yoqishi mumkin

source: Related Product
uz: Tegishli mahsulot

source: Recently Viewed
uz: Yaqinda ko'rilgan

source: Viewed Product
uz: Ko'rilgan mahsulot
